# Pandas Review

In [3]:
import pandas as pd

In [23]:
s = pd.Series([0,10,20,30,40,50])

In [24]:
print(s)

0     0
1    10
2    20
3    30
4    40
5    50
dtype: int64

In [25]:
s.dtype #gives the data type

dtype('int64')

In [26]:
s.values #give you the arrays

array([ 0, 10, 20, 30, 40, 50])

In [27]:
s.index # gives the index

RangeIndex(start=0, stop=6, step=1)

In [28]:
print(s.name)

None

In [37]:
s.name = "calories"

In [38]:
s

0     0
1    10
2    20
3    30
4    40
5    50
Name: calories, dtype: int64

# Indexing

In [39]:
s[0:2]

0     0
1    10
Name: calories, dtype: int64

In [40]:
print(s)

0     0
1    10
2    20
3    30
4    40
5    50
Name: calories, dtype: int64

In [41]:
s[2:4]

2    20
3    30
Name: calories, dtype: int64

In [42]:
#iloc is index based location finding

In [43]:
s.iloc[3]

np.int64(30)

In [36]:
s.iloc[[2,3,4]] #double brackets are needed for multiple values

2    20
3    30
4    40
Name: numbers, dtype: int64

In [56]:
index =["apple", 'banana', "grapes",'orange','strawberry','bagel']
#this is a non numerical index, meaning you cannot you iloc

In [50]:
s.index = index

In [51]:
print(s)

apple          0
banana        10
grapes        20
orange        30
strawberry    40
bagel         50
Name: calories, dtype: int64

In [55]:
s['apple']

np.int64(0)

In [57]:
#loc: lable based indexing

In [59]:
s.loc["grapes"]

np.int64(20)

In [ ]:
# in lable based indexing you shoud start as weel as stop value both are included in inpput

In [62]:
s.loc[["apple","grapes"]]

apple      0
grapes    20
Name: calories, dtype: int64

In [65]:
s.loc["apple":"grapes"] #this does not need double brackets

apple      0
banana    10
grapes    20
Name: calories, dtype: int64

In [66]:
fruit_protein = {
    "Avocado": 2.0,       # grams of protein
    "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0
}

In [69]:
s2 = pd.Series(fruit_protein)
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
dtype: float64

In [72]:
# Conditional Selection 
s2>1 #This treats the only valuable column and allow you to compare

Avocado          True
Guava            True
Blackberries     True
Oranges         False
Banana           True
Apples          False
Kiwi             True
Pomegranate      True
Mango           False
Cherries        False
dtype: bool

In [ ]:
# Conditional Selection 
s2[s2>1] #This treats the only valuable column and allow you to compare but allows you to see all the functions

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
dtype: float64

## Logical Operators
###### And, Or, Not

In [79]:
s2[(s2>.5)|(s2<=2)] # The or operator

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
dtype: float64

In [78]:
s2[(s2>.5)&(s2<=2)] # The and operator

Avocado         2.0
Blackberries    2.0
Oranges         0.9
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
dtype: float64

In [80]:
# not operation:

s2[~(s2>1)]

Oranges     0.9
Apples      0.3
Mango       0.8
Cherries    1.0
dtype: float64

# Modify the Series

In [82]:
s2["Mango"] = .8 #Adds a index value with a value 
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
dtype: float64

In [87]:
import numpy as np
ser= pd.Series(['a', np.nan, 1, np.nan, 2])
s.notnull().sum()
#not important as of now

np.int64(6)

# Dataframes

In [88]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

In [90]:
print(data)

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'], 'Age': [25, 30, 35, nan, 29, 25], 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'], 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [91]:
df = pd.DataFrame(data)

In [92]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [93]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [94]:
df.tail(3)

    Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

#### Iloc and loc functions

In [ ]:
df.iloc[1:3,:2]#rows, columns

      Name   Age
1      Bob  30.0
2  Charlie  35.0

In [96]:
df.loc[1:3,["Age","Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance
3   NaN         IT

In [97]:
df[["Age", "Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [100]:
df["Age"] #Single column

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [ ]:
# Drop column
df.drop("Age", axis =1 ) #axis 1 = drop by column and axis = 0 drop by row
#Disappears from query output but not the orginal dataframe

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [103]:
#df.drop("Age", axis =1, inplace=True ) Affects the actual dataframe

In [106]:
df.shape #rows, and columns, indexes are not included

(6, 4)

In [108]:
df.dtypes

Name           object
Age           float64
Department     object
Salary        float64
dtype: object

In [113]:
df.info() #gives you null and dtype with dtypes and memory usuage

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [114]:
df.describe() #gives all numerical columsn for alot of basic stat measures

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

# Broadcasting

In [118]:
df['Salary']= df['Salary'] + 5000 #affects all columns
df['Salary']

0    70000.0
1    80000.0
2    90000.0
3    82000.0
4        NaN
5    70000.0
Name: Salary, dtype: float64

### Renaming Columns

In [ ]:
df.rename(columns = {"Department": "Dept"}, inplace =True) #Switches Department to Dept

In [121]:
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  70000.0
1      Bob  30.0       IT  80000.0
2  Charlie  35.0  Finance  90000.0
3    David   NaN       IT  82000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  70000.0

In [123]:
df["Dept"].unique() #All uniques values that exist within a column

array(['HR', 'IT', 'Finance'], dtype=object)

In [125]:
df["Dept"].value_counts() #Shows you the # of ppl/rows that fall into each unique count

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [126]:
df["Promoted Salary"] = df["Salary"] * 10 #Makes a new calculated column

In [127]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  70000.0         700000.0
1      Bob  30.0       IT  80000.0         800000.0
2  Charlie  35.0  Finance  90000.0         900000.0
3    David   NaN       IT  82000.0         820000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  70000.0         700000.0

# Data Cleaning

In [130]:
df.isnull().sum() #goes by each column and gives total of null values 
#You can either get rid of all rows or insert values

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [131]:
#df.dropna 
#Drops all na values from each row, but you didn't use inplace = true so it does not stay in the orginal data fram e

In [133]:
df.dropna(how = "any") #Drops all na values no inplace = true, Any row that had any na value
#can all take how = "All" #only if all values in a row are na if not then they are no deleted

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  70000.0         700000.0
1      Bob  30.0       IT  80000.0         800000.0
2  Charlie  35.0  Finance  90000.0         900000.0
5    Alice  25.0       HR  70000.0         700000.0

In [ ]:
df["Age"].fillna(df["Age"].mean())
#df["Age"].fillna(df["Age"].mean(),inplace = True)

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [135]:
#df.fillna(0) #NOOB METHOD

In [136]:
df["Salary"].fillna(df["Salary"].median())

0    70000.0
1    80000.0
2    90000.0
3    82000.0
4    80000.0
5    70000.0
Name: Salary, dtype: float64

In [ ]:
df["Age"].fillna(method = "ffill")
#ffill = forward fill, you move from top to bottom

/var/folders/lt/m7_m5d6d2nq3_tl5ycf8prkc0000gn/T/ipykernel_1792/544980945.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "ffill")

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [140]:
df["Age"].fillna(method = "bfill")
#bfill = backward fill, you fill in the value from buttom to top

/var/folders/lt/m7_m5d6d2nq3_tl5ycf8prkc0000gn/T/ipykernel_1792/3053775327.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "bfill")

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [ ]:
df["Name"]=df["Name"].replace("Charlie", "Rose") #replace values that you wish to change
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  70000.0         700000.0
1    Bob  30.0       IT  80000.0         800000.0
2   Rose  35.0  Finance  90000.0         900000.0
3  David   NaN       IT  82000.0         820000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  70000.0         700000.0

# Duplicates

In [145]:
df_dup = df[df.duplicated(keep = "last")]
df_dup #your value the duplicated value that you are keeping

    Name   Age Dept   Salary  Promoted Salary
0  Alice  25.0   HR  70000.0         700000.0

# Invalid Values: 
##### Lambda Function

In [148]:
df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x: x/10 if x >650000 else x)
df

# x is the inputs

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  70000.0          70000.0
1    Bob  30.0       IT  80000.0          80000.0
2   Rose  35.0  Finance  90000.0          90000.0
3  David   NaN       IT  82000.0          82000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  70000.0          70000.0

In [ ]:
name = "alice_fernandes"
df[["first_name", "last_name"]] = df["name"].str.split("_")

In [153]:
df["Age"] = df["Age"].apply(lambda x: x/2)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  6.25       HR  70000.0          70000.0
1    Bob  7.50       IT  80000.0          80000.0
2   Rose  8.75  Finance  90000.0          90000.0
3  David   NaN       IT  82000.0          82000.0
4    Eve  7.25       HR      NaN              NaN
5  Alice  6.25       HR  70000.0          70000.0

# Joins and Merges

In [154]:
department_info = {
    "Dept": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}

df2 = pd.DataFrame(department_info)
df2

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [157]:
# Concat

df_concat= pd.concat([df, df2])
df_concat
#Allows for full outher join

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  6.25       HR  70000.0          70000.0            NaN     NaN
1    Bob  7.50       IT  80000.0          80000.0            NaN     NaN
2   Rose  8.75  Finance  90000.0          90000.0            NaN     NaN
3  David   NaN       IT  82000.0          82000.0            NaN     NaN
4    Eve  7.25       HR      NaN              NaN            NaN     NaN
5  Alice  6.25       HR  70000.0          70000.0            NaN     NaN
0    NaN   NaN       HR      NaN              NaN       New York   Laura
1    NaN   NaN       IT      NaN              NaN  San Francisco   Steve
2    NaN   NaN  Finance      NaN              NaN        Chicago    Nina

In [ ]:
pd.concat([df, df2], axis = 1)
#Join on df2 # review axis

,Name,Age,Dept,Salary,Promoted Salary,Dept,Location,Manager
0,Alice,6.25,HR,70000.0,70000.0,HR,New York,Laura
1,Bob,7.50,IT,80000.0,80000.0,IT,San Francisco,Steve
2,Rose,8.75,Finance,90000.0,90000.0,Finance,Chicago,Nina
3,David,NaN,IT,82000.0,82000.0,NaN,NaN,NaN
4,Eve,7.25,HR,NaN,NaN,NaN,NaN,NaN
5,Alice,6.25,HR,70000.0,70000.0,NaN,NaN,NaN

In [159]:
pd.merge(df, df2, on = "Dept")

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  6.25       HR  70000.0          70000.0       New York   Laura
1    Bob  7.50       IT  80000.0          80000.0  San Francisco   Steve
2   Rose  8.75  Finance  90000.0          90000.0        Chicago    Nina
3  David   NaN       IT  82000.0          82000.0  San Francisco   Steve
4    Eve  7.25       HR      NaN              NaN       New York   Laura
5  Alice  6.25       HR  70000.0          70000.0       New York   Laura

In [ ]:
#data['date'] = pd.to_datetime(data['date'])